      ******************************************************************
      * Author:rey devega
      * Date:1/31/2017
      * Purpose:Coding Object-Oriented COBOL - Define CLASS
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       Class-ID. elpsortTbl    Inherits Base.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY
           Class Base IS 'Base'.
       Factory.
           End Factory.

           Object.
               END Object.
       End Class elpSortTbl.
